<?php

	if(session_id()==''){session_start();}
	ob_start();
	mb_internal_encoding('UTF-8');

	
	$str = '144444444440000003101620162บริษัท เรโก้ เดโม จำกัด                      050000001000000003448340000000001426000000000713000000000713000
21234567891011003ศักดา                         แก้มอิ่ม                           00000001312000000000065600                           
21213141516171003สดใส                          จันทร์แจ่ม                         00000001348000000000067400                           
22123242526272003เกรียงศักดิ์                  ชูใจ                               00000001545600000000075000                           
23132343536373003มานะ                          อารี                               00000010300000000000075000                           
24142434546474003กิตติ                         ทำดี                               00000008600000000000075000                           
25152535456575004มณี                           ชิดใจ                              00000002780000000000075000                           
26162636465676004รัตนา                         กอบกู้                             00000003820000000000075000                           
27172737475767004รัชนก                         ภูผา                               00000001100000000000055000                           
28182838485868005จิตรา                         หาดี                               00000001667800000000075000                           
29192939495969005วารี                          แก้วใส                             00000002010000000000075000';
		
	$str = '120002332010000003011621162บจก.เอ็กซ์เรย์ ไอซีที แอนด์ คอนซัลติ้ง       050000000800000001638724000000001068000000000534000000000534000
23610400257598003สมนึก                         ไม้สนธิ์                           00000001200000000000060000                           
23550400026791005เพชรา                         คำนวณฐี                            00000000990000000000049500                           
21310700108373004ทิพวรรณ                       ทองแม้น                            00000002000000000000075000                           
23650100852971005กันตา                         ศรีพุ่ม                            00000001500000000000075000                           
21310700257158003สันติ                         ทองแม้น                            00000002000000000000075000                           
23440900775590003วุฒิพา                        ปุริโสตะโย                         00000002575000000000075000                           
23640200118993004ชูชีพ                         จันทร์สายทอง                       00000005132240000000075000                           
22100500037383004สิริรัตน์                     มากรัมย์                           00000000990000000000049500';

	echo 'Original text : '.$str.'<br><br>';
	echo 'Original encoding : '.mb_detect_encoding($str).'<br><br>';
	echo 'Convert to TIS-620 : '.iconv(mb_detect_encoding($str), "TIS-620", $str).'<br><br>';
	echo 'Convert to UTF-16 : '.iconv(mb_detect_encoding($str), "UTF-16", $str).'<br><br>';
	echo 'Convert to ISO-8859-11 : '.iconv(mb_detect_encoding($str), "ISO-8859-11", $str).'<br><br>';
	echo 'Convert to WINDOWS-1252 : '.iconv(mb_detect_encoding($str), "WINDOWS-1252//IGNORE", $str).'<br><br>';
	
	$string = iconv(mb_detect_encoding($str), "TIS-620", $str);
	//header('Content-type: text/plain;');
	//header("Content-Disposition: attachment; filename=textfile.txt");
	
	file_put_contents('textfile2.txt', $string);

	$fp = fopen('textfile1.txt', 'wb');
	fwrite($fp,$string);
	fclose($fp);	
	









